Revit 2027 API
BuiltInFailures.GeneralFailures.TransactionFailedWarn Property
 [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TransactionFailedWarn { get; }
Public Shared ReadOnly Property TransactionFailedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TransactionFailedWarn {
	FailureDefinitionId^ get ();
}
static member TransactionFailedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace